src/DataProcessors/ЗагрузкаСебестоимостиПолуфабрикатов/ЗагрузкаСебестоимостиПолуфабрикатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСебестоимостиПолуфабрикатов</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Себестоимость</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗарплатнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьПолная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>Серийная</name>
  </enumValues>
  <enumValues>
    <name>Предсерийная</name>
  </enumValues>
  <enumValues>
    <name>Опытная1</name>
  </enumValues>
  <enumValues>
    <name>Опытная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ЗагрузкаСебестоимостиПолуфабрикатов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Наименование,ЗарплатнаяЧасть,СебестоимостьПолная)
Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Наименование",Наименование));
флНайден = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ПолучитьСтатус(Выборка.Ссылка) <> Перечисления.СтатусыСпецификаций.Запрещённая Тогда
		флНайден = Истина;
		Себестоимость = РегистрыСведений.Себестоимость.ПолучитьПоследнее(Объект.НаДату,Новый Структура("Номенклатура,Подразделение",Выборка.Ссылка,Объект.Подразделение));
			Если (Себестоимость.ЗарплатнаяЧасть <> ЗарплатнаяЧасть)или(Себестоимость.СебестоимостьПолная <> СебестоимостьПолная) Тогда
			НоваяСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
			НоваяСебестоимость.Период = Объект.НаДату;
		    НоваяСебестоимость.Номенклатура = Выборка.Ссылка;
			НоваяСебестоимость.Подразделение = Объект.Подразделение;
			НоваяСебестоимость.ЗарплатнаяЧасть = ЗарплатнаяЧасть;
			НоваяСебестоимость.СебестоимостьПолная = СебестоимостьПолная;
			НоваяСебестоимость.Записать(Истина);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
		Если Не флНайден Тогда
		Сообщить(Наименование + " - не найдена в справочнике!");
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c себестоимостью");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка себестоимости..."); 
        ЗагрузитьНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
